# Dataframe

Park Street Ventures LLC

Subu Raj

Aug 2020

In [2]:
import pandas as pd

The primary two components of pandas are the Series and DataFrame.

A Series is essentially a column, and a DataFrame is a multi-dimensional table made up of a collection of Series.

In [13]:
# using DICT to create a dataframe
# there are many other ways to create a dataframe

data = {
     'name': ['Jennifer', 'Ann', 'Jhanvi', 'Yi', 'Kamala', 'Amal', 'Nori','Lin'],
     'city': ['New York', 'Toronto', 'Prague', 'Shanghai',
              'Manchester', 'Mumbai', 'London','Toronto'],
     'age': [41, 28, 32, 34, 38, 27, 37, 38],
     'test-score': [89.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0, 89.0]
     }



#
#data = {
#    'apples': [3, 2, 0, 1], 
#    'oranges': [0, 3, 7, 2]
#}

myDF = pd.DataFrame(data)

myDF

       name        city  age  test-score
0  Jennifer    New York   41        89.0
1       Ann     Toronto   28        79.0
2    Jhanvi      Prague   32        81.0
3        Yi    Shanghai   34        80.0
4    Kamala  Manchester   38        68.0
5      Amal      Mumbai   27        61.0
6      Nori      London   37        84.0
7       Lin     Toronto   38        89.0

In [14]:
# Additionally you can add index to the dataframe
row_labels = [101, 102, 103, 104, 105, 106, 107, 108]
myDF = pd.DataFrame(data=data, index=row_labels)

myDF

         name        city  age  test-score
101  Jennifer    New York   41        89.0
102       Ann     Toronto   28        79.0
103    Jhanvi      Prague   32        81.0
104        Yi    Shanghai   34        80.0
105    Kamala  Manchester   38        68.0
106      Amal      Mumbai   27        61.0
107      Nori      London   37        84.0
108       Lin     Toronto   38        89.0

In [15]:
# get info on the dataframe
myDF.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 101 to 108
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        8 non-null      object
 1   city        8 non-null      object
 2   age         8 non-null      int64
 3   test-score  8 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 320.0+ bytes

In [16]:
# find the total rows and columns in the dataframe
myDF.shape

(8, 4)

In [19]:
# Locate a record using the index
myDF.loc[106]

name            Amal
city          Mumbai
age               27
test-score        61
Name: 106, dtype: object

In [24]:
# save the dataframe
myDF.to_csv (r'export_dataframe.csv',  header=True)

In [26]:
# Reading CSV files is simple
df = pd.read_csv('export_dataframe.csv',index_col=0)
df.head()

         name        city  age  test-score
101  Jennifer    New York   41        89.0
102       Ann     Toronto   28        79.0
103    Jhanvi      Prague   32        81.0
104        Yi    Shanghai   34        80.0
105    Kamala  Manchester   38        68.0